sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c_master.c
    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_STOPE);
}

/* --------------------------------------------------------------------------
 * Issue one-byte write
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_write_byte_issue(
    dspic33ak_i2c_instance_t inst,
    uint8_t data)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_IWCOL)) {
        dspic33ak_i2c_reg_clear(r->STAT1, DSPIC33AK_I2C_STAT1_IWCOL);
    }

    dspic33ak_i2c_reg_clear(r->STAT2, DSPIC33AK_I2C_STAT2_NACKE);
    *r->TRN = data;
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check one-byte write busy flag
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_write_byte_busy(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_TRSTAT);
}

/* --------------------------------------------------------------------------
 * Check ACK result after one-byte write
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_write_byte_acked(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    /*
     * ACK completion is validated by the byte-phase state checks in
     * write_byte_blocking().  Avoid using ACKSTAT here because this driver
     * uses NACKE and D_A as the observable transfer outcome.
     */
    if (dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_NACKE)) {
        return false;
    }

    return true;
}

/* --------------------------------------------------------------------------
 * Issue one-byte read
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_read_byte_issue(
    dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_RCEN);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check receive buffer ready
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_read_byte_ready(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_RBF);
}

/* --------------------------------------------------------------------------
 * Get received byte
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_read_byte_get(
    dspic33ak_i2c_instance_t inst,
    uint8_t *data)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st;

    if (data == 0) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = dspic33ak_i2c_get_regs(inst, &r);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    *data = (uint8_t)(*r->RCV & 0xFFu);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Issue ACK or NACK after read
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_ack_issue(
    dspic33ak_i2c_instance_t inst,
    bool ack)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (ack) {
        dspic33ak_i2c_reg_clear(r->CON1, DSPIC33AK_I2C_CON1_ACKDT);
    } else {
        dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_ACKDT);
    }

    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_ACKEN);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check ACK/NACK issue busy flag
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_ack_busy(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_ACKEN);
}

/* --------------------------------------------------------------------------
 * Check I2C error status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_has_error(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return true;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_ERR);
}

/* --------------------------------------------------------------------------
 * Check NACK status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_has_nack(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return true;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_NACKE);
}

/* --------------------------------------------------------------------------
 * Check bus collision status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_has_collision(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return true;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT1,
                                    DSPIC33AK_I2C_STAT1_IWCOL |
                                    DSPIC33AK_I2C_STAT1_BCL);
}

/* --------------------------------------------------------------------------
 * Enable selected I2C interrupts - future helper
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_irq_enable(
    dspic33ak_i2c_instance_t inst,
    uint32_t irq_mask)
{
    (void)inst;
    (void)irq_mask;
    return DSPIC33AK_I2C_ERR_UNSUPPORTED;
}

/* --------------------------------------------------------------------------
 * Disable selected I2C interrupts - future helper
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_irq_disable(
    dspic33ak_i2c_instance_t inst,
    uint32_t irq_mask)
{
    (void)inst;
    (void)irq_mask;
    return DSPIC33AK_I2C_ERR_UNSUPPORTED;
}

/* --------------------------------------------------------------------------
 * Clear selected I2C interrupt flags - future helper
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_irq_clear(
    dspic33ak_i2c_instance_t inst,
    uint32_t irq_mask)
{
    (void)inst;
    (void)irq_mask;
    return DSPIC33AK_I2C_ERR_UNSUPPORTED;
}

/* ========================================================================== */
/* 3. Static local helper functions                                           */
/* ========================================================================== */

/* inst_is_valid and get_regs are shared primitives defined in
 * dspic33ak_i2c_common.c. */

/* --------------------------------------------------------------------------
 * Resolve registers and require initialized state
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t require_initialized(
    dspic33ak_i2c_instance_t inst,
    const dspic33ak_i2c_regs_t **regs)
{
    dspic33ak_i2c_status_t st;

    if (!dspic33ak_i2c_inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

