sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c_master.c
    st = dspic33ak_i2c_get_regs(inst, regs);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!g_initialized[inst]) {
        return DSPIC33AK_I2C_ERR_NOT_INITIALIZED;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Require initialized state without exposing register pointer to caller
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t check_initialized(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    return require_initialized(inst, &r);
}

/* calc_brg is a shared primitive defined in dspic33ak_i2c_common.c. */

/* --------------------------------------------------------------------------
 * Check whether timeout is enabled
 * -------------------------------------------------------------------------- */
static bool timeout_enabled(dspic33ak_i2c_instance_t inst)
{
    return dspic33ak_i2c_inst_is_valid(inst) &&
           (g_get_ms[inst] != 0) &&
           (g_timeout_ms[inst] != 0u);
}

/* --------------------------------------------------------------------------
 * Capture timeout start tick
 * -------------------------------------------------------------------------- */
static uint32_t timeout_start_ms(dspic33ak_i2c_instance_t inst)
{
    if (!timeout_enabled(inst)) {
        return 0u;
    }

    return g_get_ms[inst]();
}

/* --------------------------------------------------------------------------
 * Check timeout expiration
 * -------------------------------------------------------------------------- */
static bool timeout_expired(dspic33ak_i2c_instance_t inst, uint32_t start_ms)
{
    uint32_t now;

    if (!timeout_enabled(inst)) {
        return false;
    }

    now = g_get_ms[inst]();
    return ((uint32_t)(now - start_ms) >= g_timeout_ms[inst]);
}

/* --------------------------------------------------------------------------
 * Check whether pending transaction timeout is enabled
 * -------------------------------------------------------------------------- */
static bool pending_timeout_enabled(dspic33ak_i2c_instance_t inst)
{
    return dspic33ak_i2c_inst_is_valid(inst) &&
           (g_get_ms[inst] != 0) &&
           (g_pending_timeout_ms[inst] != 0u);
}

/* --------------------------------------------------------------------------
 * Check pending transaction timeout expiration
 * -------------------------------------------------------------------------- */
static bool pending_timeout_expired(dspic33ak_i2c_instance_t inst)
{
    uint32_t now;

    if (g_pending_state[inst] == DSPIC33AK_I2C_PENDING_NONE) {
        return false;
    }

    if (!pending_timeout_enabled(inst)) {
        return false;
    }

    now = g_get_ms[inst]();
    return ((uint32_t)(now - g_pending_start_ms[inst]) >=
            g_pending_timeout_ms[inst]);
}

/* --------------------------------------------------------------------------
 * Clear pending transaction state
 * -------------------------------------------------------------------------- */
static void pending_clear(dspic33ak_i2c_instance_t inst)
{
    if (!dspic33ak_i2c_inst_is_valid(inst)) {
        return;
    }

    g_pending_state[inst] = DSPIC33AK_I2C_PENDING_NONE;
    g_pending_start_ms[inst] = 0u;
}

/* --------------------------------------------------------------------------
 * Set pending transaction state
 * -------------------------------------------------------------------------- */
static void pending_set(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_pending_state_t state)
{
    if (!dspic33ak_i2c_inst_is_valid(inst)) {
        return;
    }

    g_pending_state[inst] = state;
    g_pending_start_ms[inst] = pending_timeout_enabled(inst) ?
                               g_get_ms[inst]() :
                               0u;
}

/* --------------------------------------------------------------------------
 * Recover a stale no-STOP transaction if its pending timeout has elapsed
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t recover_stale_pending_if_needed(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = check_initialized(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!pending_timeout_expired(inst)) {
        return DSPIC33AK_I2C_OK;
    }

    st = stop_quiet(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    pending_clear(inst);
    return DSPIC33AK_I2C_ERR_TIMEOUT;
}

/* --------------------------------------------------------------------------
 * Public API guard for starting a new non-pending transaction
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t begin_independent_transaction(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    /*
     * recover_stale_pending_if_needed() returns ERR_TIMEOUT when it had to
     * force a stale no-STOP transaction closed.  Propagate it: the caller
     * must observe that its previous transaction was recovered and retry,
     * rather than have a fresh transfer silently started in its place.
     */
    st = recover_stale_pending_if_needed(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (g_pending_state[inst] != DSPIC33AK_I2C_PENDING_NONE) {
        return DSPIC33AK_I2C_ERR_BUSY;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Internal master write sequence that intentionally leaves STOP pending
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t write_no_stop_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len)
{
    dspic33ak_i2c_status_t st;
    size_t i;

    st = start_blocking(inst);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    st = send_address_blocking(inst, addr7, false);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    for (i = 0u; i < tx_len; i++) {
        st = write_byte_blocking(inst, tx[i]);
        if (st != DSPIC33AK_I2C_OK) {
            (void)stop_quiet(inst);
            return st;
        }
    }

    pending_set(inst, DSPIC33AK_I2C_PENDING_MASTER_WRITE);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Internal repeated START read sequence from a pending write
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t read_after_restart_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    uint8_t *rx,
    size_t rx_len)
{
    dspic33ak_i2c_status_t st;
    size_t i;

    st = restart_blocking(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return abort_pending_sequence(inst, st);
    }

    st = send_address_blocking(inst, addr7, true);
    if (st != DSPIC33AK_I2C_OK) {
        return abort_pending_sequence(inst, st);
    }

    for (i = 0u; i < rx_len; i++) {
        bool ack = ((i + 1u) < rx_len);
        st = read_byte_blocking(inst, &rx[i], ack);
        if (st != DSPIC33AK_I2C_OK) {
            return abort_pending_sequence(inst, st);
        }
    }

    return stop_pending_sequence(inst);
}

/* --------------------------------------------------------------------------
 * Internal STOP sequence for a known pending transaction
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t stop_pending_sequence(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

