sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c_master.c
    /*
     * Clear the pending state only once STOP has actually completed.  If STOP
     * fails the bus is not cleanly released, so keep the transaction pending:
     * the next public call is then rejected with ERR_BUSY (or recovered by the
     * pending timeout) instead of starting a new transfer on a stuck bus.
     */
    st = stop_quiet(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    pending_clear(inst);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Try to STOP after a pending transaction error
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t abort_pending_sequence(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_status_t original_status)
{
    dspic33ak_i2c_status_t stop_status;

    /*
     * Best-effort STOP after a failed transfer.  If STOP itself fails the bus
     * is not recovered, so surface the STOP error and keep the transaction
     * pending so the caller can tell that recovery did not complete.  Only on
     * a clean STOP do we clear the pending state and return the original
     * transfer error (e.g. ERR_NACK) as the diagnostic result.
     */
    stop_status = stop_quiet(inst);
    if (stop_status != DSPIC33AK_I2C_OK) {
        return stop_status;
    }

    pending_clear(inst);
    return original_status;
}

/* --------------------------------------------------------------------------
 * Clear transfer-related status bits
 * -------------------------------------------------------------------------- */
static void clear_transfer_status(const dspic33ak_i2c_regs_t *r)
{
    /*
     * Keep status cleanup narrow.  Do not blindly write zero to all status
     * bits; only clear the bits used by this readable driver.
     */
    dspic33ak_i2c_reg_clear(r->STAT1,
                            DSPIC33AK_I2C_STAT1_IWCOL |
                            DSPIC33AK_I2C_STAT1_I2COV |
                            DSPIC33AK_I2C_STAT1_BCL);
    dspic33ak_i2c_reg_clear(r->STAT2,
                            DSPIC33AK_I2C_STAT2_ERR |
                            DSPIC33AK_I2C_STAT2_STARTE |
                            DSPIC33AK_I2C_STAT2_STOPE |
                            DSPIC33AK_I2C_STAT2_NACKE);
}

/* --------------------------------------------------------------------------
 * Convert bus fault status to driver status
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t check_bus_fault(dspic33ak_i2c_instance_t inst)
{
    if (dspic33ak_i2c_ll_has_collision(inst)) {
        return DSPIC33AK_I2C_ERR_COLLISION;
    }

    if (dspic33ak_i2c_ll_has_nack(inst)) {
        return DSPIC33AK_I2C_ERR_NACK;
    }

    if (dspic33ak_i2c_ll_has_error(inst)) {
        return DSPIC33AK_I2C_ERR_BUS;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Wait for condition using optional timeout
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t wait_until(
    dspic33ak_i2c_instance_t inst,
    bool (*done_fn)(dspic33ak_i2c_instance_t),
    bool check_nack)
{
    uint32_t start_ms = timeout_start_ms(inst);
    dspic33ak_i2c_status_t st;

    while (!done_fn(inst)) {
        if (check_nack) {
            st = check_bus_fault(inst);
        } else {
            if (dspic33ak_i2c_ll_has_collision(inst)) {
                st = DSPIC33AK_I2C_ERR_COLLISION;
            } else if (dspic33ak_i2c_ll_has_error(inst)) {
                st = DSPIC33AK_I2C_ERR_BUS;
            } else {
                st = DSPIC33AK_I2C_OK;
            }
        }

        if (st != DSPIC33AK_I2C_OK) {
            return st;
        }

        if (timeout_expired(inst, start_ms)) {
            return DSPIC33AK_I2C_ERR_TIMEOUT;
        }
    }

    if (dspic33ak_i2c_ll_has_collision(inst)) {
        return DSPIC33AK_I2C_ERR_COLLISION;
    }

    if (dspic33ak_i2c_ll_has_error(inst)) {
        return DSPIC33AK_I2C_ERR_BUS;
    }

    if (check_nack) {
        return check_bus_fault(inst);
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Adapter: host state machine active condition
 * -------------------------------------------------------------------------- */
static bool host_active(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_HSTACT);
}

/* --------------------------------------------------------------------------
 * Adapter: write byte ready condition
 * -------------------------------------------------------------------------- */
static bool write_byte_ready(dspic33ak_i2c_instance_t inst)
{
    /*
     * Same hardware bit as write_byte_done(), different phase meaning:
     * before TRN write, TRSTAT clear means the transmit state is ready.
     */
    return !dspic33ak_i2c_ll_write_byte_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: write byte done condition
 * -------------------------------------------------------------------------- */
static bool write_byte_done(dspic33ak_i2c_instance_t inst)
{
    /*
     * Same hardware bit as write_byte_ready(), different phase meaning:
     * after TRN write, TRSTAT clear means the current byte transfer is done.
     */
    return !dspic33ak_i2c_ll_write_byte_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: data/address phase accepted condition
 * -------------------------------------------------------------------------- */
static bool write_data_accepted(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_D_A);
}

/* --------------------------------------------------------------------------
 * Adapter: ACK issue done condition
 * -------------------------------------------------------------------------- */
static bool ack_done(dspic33ak_i2c_instance_t inst)
{
    return !dspic33ak_i2c_ll_ack_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: STOP fully completed condition
 *
 * STAT2.STOPE (the STOP event flag) is set slightly before the hardware clears
 * CON1.PEN (the STOP request bit).  A STOP is only truly finished, and the bus
 * only actually released, once PEN has returned to 0.  Waiting on STOPE alone
 * lets the next transaction issue START (SEN) while PEN is still set; the host
 * ignores SEN during a pending STOP, so START never happens and the transfer
 * times out.  This is invisible at fast bus speeds (PEN clears within a short
 * bit period) but reproducibly breaks slow speeds such as 100 kHz.  Require
 * both STOPE set and PEN clear so callers never start a new transfer on a bus
 * whose STOP has not yet retired.
 * -------------------------------------------------------------------------- */
static bool stop_fully_done(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (dspic33ak_i2c_get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_STOPE) &&
           !dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_PEN);
}

/* --------------------------------------------------------------------------
 * Issue STOP and wait quietly
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t stop_quiet(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_stop_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, stop_fully_done, false);
}

/* --------------------------------------------------------------------------
 * Issue START and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t start_blocking(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_start_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

