sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c_master.c
    return wait_until(inst, dspic33ak_i2c_ll_start_done, false);
}

/* --------------------------------------------------------------------------
 * Issue repeated START and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t restart_blocking(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_restart_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, dspic33ak_i2c_ll_restart_done, false);
}

/* --------------------------------------------------------------------------
 * Write one byte and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t write_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t data)
{
    dspic33ak_i2c_status_t st;

    /*
     * Byte write sequence:
     *   1. wait until the transmit state is idle
     *   2. wait until the host state machine owns the bus
     *   3. write TRN
     *   4. wait until the transmit state is complete
     *   5. wait until the module reports address/data phase accepted
     */
    st = wait_until(inst, write_byte_ready, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, host_active, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_write_byte_issue(inst, data);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, write_byte_done, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, write_data_accepted, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!dspic33ak_i2c_ll_write_byte_acked(inst)) {
        return DSPIC33AK_I2C_ERR_NACK;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Read one byte, issue ACK/NACK, and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t read_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t *data,
    bool ack)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_read_byte_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, dspic33ak_i2c_ll_read_byte_ready, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_read_byte_get(inst, data);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_ack_issue(inst, ack);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, ack_done, false);
}

/* --------------------------------------------------------------------------
 * Send 7-bit address with R/W bit
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t send_address_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    bool read)
{
    uint8_t addr_byte = (uint8_t)((addr7 << 1) | (read ? 1u : 0u));
    return write_byte_blocking(inst, addr_byte);
}
